<template>
	<view class="main">
		<view class="text_area">
			<view class="title">
				用户协议
			</view>
			<view class="underline"></view>
		</view>
		<view class="babyInfo">
			<view class="">
				宝育之家用户协议
			</view>
			<view class="babyInfoList">
				一、导言1.1 本协议是您（亦称“用户”）与宝育之家之间就用户使用“宝育之家”小程序及相关服务（下称“本服务”）所订立的协议。1.2 宝育之家提醒您在使用本服务前认真阅读、充分理解本协议条款、包括免除或限制宝育之家的免责条款以及对使用本服务的用户权利的限制条款。请您审慎阅读并确认（未成年人应在法定监护人陪同下阅读和使用）。1.3 您使用本服务即视为您已阅读并同意本协议条款。宝育之家有权在必要时修改本协议条款，并公示于本服务。您可以在本服务的最新版本中查阅相关协议条款。本协议条款变更后，如您继续使用本服务，视作您已接受修改后的协议。 二、关于本服务2.1 本服务为您提供育儿管理相关的互联网信息服务，如疫苗接种管理：选择接种方案、接种任务提醒、更新接种记录等。宝育之家保留随时新增、变更、中断或终止部分或全部服务的权利。2.2  除特别说明外，“宝育之家”不断推出的新功能、新服务，均适用本协议之规范。如本服务中某一特定功能服务另有单独协议，则该单独协议为本协议之补充，您使用该特定服务即视为同意本协议及单独协议。 三、权利义务及责任声明3.1 本服务所提供的信息，旨在为用户提供育儿知识及育儿过程管理，仅供用户参考之用，您应对本服务中的信息自行甄别和判断，并承担因使用信息或依照信息所作行为而引起的所有风险，包括因对信息的正确性、完整性、实用性或个案适用性的依赖而产生的风险。宝育之家无法且不会对因前述风险而导致的任何损失或损害承担责任。3.2  宝育之家不保证向用户提供便利而设置的外部链接的准确性、完整性和安全性，同时，对于该等外部链接指向的不由本服务实际控制的任何内容，宝育之家不承担任何责任。 3.3  宝育之家保留自行决定更正本服务中任何部分的任何错误或遗漏的权利。 3.4  用户行为规范3.4.1您在使用本服务前需要对宝育之家进行授权，并对授权帐号下的行为承担法律责任。3.4.2用户不得通过本服务发布、传播、传送任何违法违规、违反社会公德、侵犯他人权益、干扰本软件及服务正常运营或带有广告、营销信息、垃圾信息、骚扰信息、淫秽信息、虚假不实信息等的内容，包括但不限于：（1）违反宪法确定的基本原则的；（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；（3）损害国家荣誉和利益的；（4）煽动民族仇恨、民族歧视，破坏民族团结的；（5）破坏国家宗教政策，宣扬邪教和封建迷信的；（6）散布谣言，扰乱社会秩序，破坏社会稳定的；（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；（8）侮辱或者诽谤他人，侵害他人合法权益的；（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；（10）以非法民间组织名义活动的；（11）不符合法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；（12）侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；（13）涉及他人隐私、个人信息或资料的；（14）含有软件病毒、蠕虫、木马或其他有害的计算机代码、文件、脚本、代理或程序的资料；（15）其他根据法律法规及本条款约定禁止的信息内容。3.4.3任何经由本服务以上载、张贴、发送即时消息、电子邮件或任何其他方式复制、发布、传播、传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息、用户的登记资料或其他资料（本条款简称“内容”），均由内容提供者承担责任，宝育之家无法保证上述内容的合法性、正确性、完整性、真实性或品质。根据相关法律规定，宝育之家有权对用户使用本服务以任何方式上载或发布的信息内容进行审查、监督及处理，对发布违法违规信息内容的，有权依法停止传输，视情况采取警示、限制功能、暂停更新、关闭帐号等处置措施，保存记录并向有关主管部门报告。3.5您理解并同意，宝育之家有权依合理判断对违反有关法律法规或本协议规定的行为进行处理，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任，包括但不限于因此导致第三方的损失、宝育之家的损失等。3.6  在法律允许的范围内，宝育之家对以下不可掌控的情形导致的服务无法正常使用及其引发的结果不承担责任：3.6.1不可抗力（包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等）；3.6.2受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；3.6.3电脑软件、系统、硬件和通信线路出现故障；3.6.4电信部门技术调整或故障；3.6.5因系统维护、升级需要而造成的暂时中断，但宝育之家将尽力及时恢复，减少不利影响；3.6.6因其他第三方原因导致的； 3.6.7用户自身的操作不当；3.6.8由于网络信号不稳定、带宽小等原因，所引起的登录失败、页面打开速度慢等风险； 四、知识产权声明4.1  宝育之家拥有本服务内所有内容（含软件本身）的知识产权，所有这些内容受著作权、商标权、专利权和其它财产所有权法律的保护。任何人只有在获得宝育之家的书面授权之后才能使用这些内容，而不能擅自复制、修改、制作衍生产品、进行还原工程、反向编译，或以其它方式转移任何权利，或用于任何商业目的。4.2  用户在此同意，除用户在上传或发布时特别声明保留具体权利的以外，将其在任何时间段发表在“宝育之家”服务中的任何形式的信息内容的著作权的财产性权利（如复制权、发行权、出租权、展览权、信息网络传播权、改编权、翻译权、汇编权等），全部独家地、永久免费地、不可撤销地转让给宝育之家，且宝育之家有权将上述权利让渡给其它个人、组织或机构。本协议已构成《中华人民共和国著作权法》及相关法律法规规定的财产性著作权转让书面协议，无论该等内容形成于本协议订立前还是订立后。同时，用户同意一并将上述信息内容中包含的肖像权（如有）无条件无期限授予宝育之家小程序及相关服务中使用。五、其他5.1本协议签订地约定为北京。5.2本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律（不包括冲突法）。
			</view>
		</view>
	</view>
</template>

<script>
	
	export default {
		data() {
			return {
				
			};
		},
		onLoad(option){
			
		},
		methods:{
			
		}
	}
</script>

<style lang="less">
.main{
	padding: 20rpx 6%;
	.text_area{
		padding-left: 20rpx;
		.title{
			font-size: 54rpx;
			color: #000;
			position: relative;
			z-index: 9999;
		}
		.underline{
			width: 155rpx;
			height: 24rpx;
			background: #8686F7;
			position: relative;
			top: -22rpx;
			left: 30rpx;
			border-radius: 20rpx;

		}
	}
	.babyInfo{
		margin-top: 60rpx;
		.babyInfoList{
			padding: 15px 0;
			width: 100%;
			// background: #FAFAFB;
			margin-bottom:30rpx;
			border-radius: 20rpx;
			display: flex;
			flex-direction: row;
		}
	}
}

</style>
