<template>
	<view class="main">
		<view class="text_area">
			<view class="title">
				隐私政策
			</view>
			<view class="underline"></view>
		</view>
		<view class="babyInfo">
			<view class="">
				宝育之家隐私政策
			</view>
			<view class="babyInfoList">
				更新日期：2019年11月28日
				生效日期：2018年11月28日	
				宝育之家（以下或称“我们”）非常重视用户（“您”）的个人信息及隐私，我们深知个人信息对您的重要性，并将按照法律法规要求和业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。我们希望通过本隐私政策向您清晰地介绍在使用我们的产品\服务时，我们如何收集、使用、披露、转让以及存储你的个人信息。【特别提示】请您在使用我们提供的各项产品\服务前，仔细阅读并充分理解本《隐私政策》并作出相应选择。一旦您使用或继续使用我们的产品\服务时，即意味着您同意我们按照本隐私政策处理您的相关信息。一、个人信息的收集与使用	个人信息是可用于识别或联系特定个人的数据。我们会遵循正当、合法、必要的原则，出于本政策所述的以下目的，收集和使用您在使用服务过程中主动提供或产生的个人信息，您不是一定要提供我们要求的个人信息，但在许多情况下，如果您选择不提供，我们将无法为您提供我们的相关服务，也无法回应您遇到的问题。（一）我们收集哪些信息微信授权信息：微信头像、昵称、性别个人信息：手机号码、生日、所在地宝宝信息：爱称、性别、生日、所在地、接种点地理位置（二）如何使用您的信息	当宝育之家需要履行法定义务以便保护您的切身利益时，我们认为有必要保护宝育之家的合法利益时，或宝育之家有必要向第三方披露信息时，我们将在争得您同意的前提下，出于本隐私政策中描述的目的，对您的个人信息进行使用：利用我们收集的个人信息，我们可以将宝育之家的任务提醒、功能更新及活动预告及时通知您。如果您不希望收到消息通知，可随时通过提醒设置选择退出。我们还会将个人信息用于以下目的：帮助我们创建、开发、运作、提供和改进我们的产品、服务、内容，以及防丢失和防欺诈目的。我们可能还会出于帐户和网络安全的目的使用你的个人信息。有时，我们可能会使用个人信息发送重要通知。我们还会将个人信息用于数据分析和研究等内部目的，以改进我们的产品、服务和与客户之间的沟通。二、向第三方披露	有时，宝育之家可能会向第三方（如接种门诊）提供某些个人信息，以提供或改进我们的产品和服务。当我们这样做时，我们要求这些第三方按照相关法律处理。我们绝不会出于第三方的市场营销目的而与第三方共享个人信息。三、个人信息的保护	宝育之家非常重视你的个人信息的安全。当您使用宝育之家产品\服务时，您公开分享的个人信息和内容会被其他用户看到，他们可能会阅读、收集或使用你的个人信息。对于您决定在上述情形中分享或提交的个人信息，你应自行负责。四、个人信息的完整性和保留	宝育之家提供了一些便捷的方法，让你能够确保你的个人信息准确、完整并及时更新。我们将在实现本隐私政策中以及特定服务隐私摘要中所述目的所必需的期间内保留你的个人信息。在评估上述时长时，我们会审慎核实我们是否有必要收集个人信息，如果我们认为的确有必要收集个人信息，也会将保留该信息的时长控制在实现相关目的所需的最短时长范围内，除非法律要求将其保留更长时间。五、对你隐私的承诺	为确保你个人信息的安全，宝育之家向您承诺严格执行隐私保护措施。
			</view>
		</view>
	</view>
</template>

<script>
	
	export default {
		data() {
			return {
				
			};
		},
		onLoad(option){
			
		},
		methods:{
			
		}
	}
</script>

<style lang="less">
.main{
	padding: 20rpx 6%;
	.text_area{
		padding-left: 20rpx;
		.title{
			font-size: 54rpx;
			color: #000;
			position: relative;
			z-index: 9999;
		}
		.underline{
			width: 155rpx;
			height: 24rpx;
			background: #8686F7;
			position: relative;
			top: -22rpx;
			left: 30rpx;
			border-radius: 20rpx;

		}
	}
	.babyInfo{
		margin-top: 60rpx;
		.babyInfoList{
			padding: 15px 0;
			width: 100%;
			// background: #FAFAFB;
			margin-bottom:30rpx;
			border-radius: 20rpx;
			display: flex;
			flex-direction: row;
		}
	}
}

</style>
